Ran Plan for project: `project-staging` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.default must be replaced
-/+ resource "google_compute_instance" "default" {
      ~ cpu_platform         = "Intel Cascade Lake" -> (known after apply)
      ~ current_status       = "RUNNING" -> (known after apply)
      ~ effective_labels     = {} -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/poc-franck/zones/europe-west1-b/instances/atlantis-instance-prod" -> (known after apply)
      ~ instance_id          = "5850801992141947939" -> (known after apply)
      ~ label_fingerprint    = "42WmSpB8rSM=" -> (known after apply)
      - labels               = {} -> null
      ~ metadata             = {
          ~ "env" = "prod" -> "staging"
        }
      ~ metadata_fingerprint = "OeSNThh-wO8=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
      ~ name                 = "atlantis-instance-prod" -> "atlantis-instance-stag" # forces replacement
      - resource_policies    = [] -> null
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/poc-franck/zones/europe-west1-b/instances/atlantis-instance-prod" -> (known after apply)
        tags                 = [
            "bar",
            "foo",
        ]
      ~ tags_fingerprint     = "1gqCRgrww4E=" -> (known after apply)
      ~ terraform_labels     = {} -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/poc-franck/zones/europe-west1-b/disks/atlantis-instance-prod" -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ initialize_params {
              - enable_confidential_compute = false -> null
              ~ image                       = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-11-bullseye-v20240611" -> "debian-cloud/debian-11"
              ~ provisioned_iops            = 0 -> (known after apply)
              ~ provisioned_throughput      = 0 -> (known after apply)
              - resource_manager_tags       = {} -> null
              ~ size                        = 10 -> (known after apply)
              ~ type                        = "pd-standard" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          ~ network                     = "https://www.googleapis.com/compute/v1/projects/poc-franck/global/networks/default" -> "default"
          ~ network_ip                  = "10.132.0.38" -> (known after apply)
          - queue_count                 = 0 -> null
          ~ stack_type                  = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork                  = "https://www.googleapis.com/compute/v1/projects/poc-franck/regions/europe-west1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project          = "poc-franck" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ access_config {
              ~ nat_ip                 = "35.233.43.55" -> (known after apply)
              ~ network_tier           = "PREMIUM" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      - scheduling {
          - automatic_restart           = true -> null
          - min_node_cpus               = 0 -> null
          - on_host_maintenance         = "MIGRATE" -> null
          - preemptible                 = false -> null
          - provisioning_model          = "STANDARD" -> null
            # (1 unchanged attribute hidden)
        }

      ~ scratch_disk {
          ~ device_name = "local-ssd-0" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p project-staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://84a6-2001-861-4900-61f0-9565-4c35-2d6c-b55e.ngrok-free.app/lock?id=franck-art%252Fterraform-atlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p project-staging
  ```
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```